Revit 2027 API
FilledRegionType.IsValidBackgroundPatternId Method
 Check if the id is valid for a background pattern
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidBackgroundPatternId(
	ElementId patternId
)
Public Function IsValidBackgroundPatternId (
	patternId As ElementId
) As Boolean
public:
bool IsValidBackgroundPatternId(
	ElementId^ patternId
)
member IsValidBackgroundPatternId :
        patternId : ElementId -> bool
Parameters
patternId ElementId
 Element id of the FillPatternElement
Return Value
Boolean
 False if the FillPatternElement is a model pattern. True otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The FillPatternElement must be a 'Drafting' pattern.
See Also
Reference
FilledRegionType Class
Autodesk.Revit.DB Namespace